public/coding/script-fu.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-06 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scripting with Script-Fu in GIMP to process photos in batch</title>
<meta name="author" content="Yu Huo" />
<meta name="generator" content="Org Mode" />
<link href="https://cdn.simplecss.org/simple.min.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><main id="content" class="content">
<header>
<h1 class="title">Scripting with Script-Fu in GIMP to process photos in batch</h1>
</header><p>
I&rsquo;m now trying out <a href="https://www.gimp.org/">GIMP</a> for photo editing.
I know it supports scripting with <a href="https://docs.gimp.org/en/gimp-using-script-fu-tutorial.html">Script-Fu</a>, a programming language based on Scheme, a minimalist Lisp dialect.
Today, I was trying to compress some photos to be uploaded to my blog.
Instead of opening and editing the photos one by one, why don&rsquo;t I try out Script-Fu to do the job in batch?
</p>

<section id="outline-container-org60df844" class="outline-2">
<h2 id="org60df844"><span class="section-number-2">1.</span> Running functions inside a <code>*.scm</code> script file from the console</h2>
<div class="outline-text-2" id="text-1">
<p>
Each of my script file ends with <code>.scm</code>, which stands for Scheme.
To be loaded into GIMP, the file should be in
</p>
<div class="org-src-container">
<pre class="src src-shell">~/.config/GIMP/2.10/scripts
</pre>
</div>
<p>
on my computer, which runs Linux and has GIMP 2.10 installed.
Within each file, there are just a collection of functions written by myself, and those functions will be loaded into GIMP and can be called from the Script-Fu console.
</p>

<p>
For example, let&rsquo;s say I have a function <code>hello-world</code>
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #5EC4FF;">define</span> (<span style="color: #33CED8;">hello-world</span>) (gimp-message <span style="color: #539AFC;">"hello world"</span>))
</pre>
</div>
<p>
in the file, I can open the console in GIMP by finding <code>Filter &gt;&gt; Script-Fu &gt;&gt; Console</code> on the menu bar.
If I call the function by typing
</p>
<div class="org-src-container">
<pre class="src src-scheme">(hello-world)
</pre>
</div>
<p>
in the prompt, it will prompt a message saying &ldquo;hello world&rdquo; (and return a true value <code>#t</code>).
</p>

<p>
We can also run the script from the operating system&rsquo;s console:
</p>
<div class="org-src-container">
<pre class="src src-shell">gimp -i -b <span style="color: #539AFC;">'(hello-world)'</span>
</pre>
</div>
<p>
where <code>-i</code> stands for no interface and <code>-b</code> stands for batch mode (which accepts function call).
After the call was run, we can type <code>^C</code> (<code>Ctrl+C</code>) to exit.
</p>
</div>
</section>

<section id="outline-container-org00cf898" class="outline-2">
<h2 id="org00cf898"><span class="section-number-2">2.</span> Getting help</h2>
<div class="outline-text-2" id="text-2">
<p>
I&rsquo;m new to Scheme, but I know Emacs Lisp, another Lisp dialect, so reading Lisp code is fine with me.
Still, I need to know (1) some basic functions and macros of Scheme (e.g. conditional statements) and (2) the APIs of GIMP (e.g. <code>gimp-image-resize</code>).
I found that the <a href="https://en.wikipedia.org/wiki/Scheme_(programming_language)">Wikipedia page of Scheme</a> has a good cheatsheet for the basics of Scheme, and right next to the prompt within the GIMP console, the <code>Browse...</code> button allows us to search the documentations of the GIMP API functions.
</p>
</div>
</section>

<section id="outline-container-org122e9ea" class="outline-2">
<h2 id="org122e9ea"><span class="section-number-2">3.</span> Now implement the code</h2>
<div class="outline-text-2" id="text-3">
<p>
I found a <a href="https://stackoverflow.com/questions/51337105/batch-resize-images-with-gimp">Script</a> on Stackoverflow, so I only need to adapt the code for my own use (many thanks!).
To be fair, the code should work almost out-of-box in my case,
but I modified it a bit to satisfy my own taste (to make it functional instead of imperative) and to simplify the call from command line.
Here it is:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #5EC4FF;">define</span> (<span style="color: #33CED8;">batch-resize</span> dir)
  (<span style="color: #5EC4FF;">let*</span> ((filelist (cadr (file-glob (string-append dir <span style="color: #539AFC;">"/*.JPG"</span>) <span style="color: #E27E8D; font-weight: bold;">1</span>))))
        (batch-resize-list filelist)))

(<span style="color: #5EC4FF;">define</span> (<span style="color: #33CED8;">batch-resize-list</span> filelist)
  (<span style="color: #5EC4FF;">unless</span> (null? filelist)
    (<span style="color: #5EC4FF;">let*</span> (
           (filename (car filelist))
           (image (car (gimp-file-load <span style="color: #E27E8D; font-weight: bold;">1</span> filename filename)))
           (drawable   (car (gimp-image-active-drawable image)))
           (cur-width  (car (gimp-image-width image)))
           (cur-height (car (gimp-image-height image)))
           (width      (/ cur-width <span style="color: #E27E8D; font-weight: bold;">4</span>))
           (height     (/ cur-height <span style="color: #E27E8D; font-weight: bold;">4</span>))
           )
      (gimp-message filename)
      (gimp-image-scale-full image width height INTERPOLATION-CUBIC)
      (gimp-file-save RUN-NONINTERACTIVE image drawable filename filename))
    (batch-resize-list (cdr filelist))))
</pre>
</div>
<p>
where <code>batch-resize</code> is the function I should call and <code>batch-resize-list</code> is a helper function.
</p>

<p>
<b>WARNING</b>: This code will compress and REWRITE the original photo file, so make sure you have backups when testing it!
</p>

<p>
To call it from command line:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #EBBF83;">cd</span> &lt;my-photo-directory&gt;
gimp -b -i <span style="color: #539AFC;">"(batch-resize \"</span><span style="color: #5EC4FF; font-weight: bold;">`</span><span style="color: #5EC4FF; font-weight: bold;">pwd</span><span style="color: #5EC4FF; font-weight: bold;">`</span><span style="color: #539AFC;">\")"</span>
</pre>
</div>
<p>
Now you may see why I hard-coded the <code>*.JPG</code> pattern within the function &#x2014; I don&rsquo;t want to type in another argument when calling this function.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'> © Yu Huo 2022. Created 2023-02-05, Last updated 2023-02-06, built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.6)</div>
</footer>
</body>
</html>